let FailedIPs =
SecurityEvent
| where EventID == 4625
| summarize FailureCount=count() by IpAddress
| where FailureCount >= 10;

SecurityEvent
| where EventID == 4624
| where IpAddress != "-"
| join kind=inner FailedIPs on IpAddress
| project
    TimeGenerated,
    IpAddress,
    TargetUserName,
    FailureCount,
    Computer
